app/controllers/admin/courses_controller.rb

  def index # rubocop:disable Metrics/MethodLength
    @courses = []
    Course.all.each do |course|
      @courses.push(course)
---
SELECT `courses`.* FROM `courses`
INSERT INTO `courses` (`course_name`, `description`, `summary`, `user_id`, `created_at`, `updated_at`) VALUES ('HTML', 'dfnjkdsfnjkdsf', 'fdsfdsfsdfgsdafdsafgdsafg', 1, '2023-09-26 10:07:23.586020', '2023-09-26 10:07:23.586020')

  def create
    @course = Course.new(course_params)
    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`course_name`, `description`, `summary`, `user_id`, `created_at`, `updated_at`) VALUES ('HTML', 'dfnjkdsfnjkdsf', 'fdsfdsfsdfgsdafdsafgdsafg', 1, '2023-09-26 10:07:23.586020', '2023-09-26 10:07:23.586020')

  def edit
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1

  def update # rubocop:disable Metrics/AbcSize
    @course = Course.find(params[:id])
    respond_to do |format|
      if @course.update(course_params)
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
UPDATE `courses` SET `courses`.`description` = 'Learn HTML', `courses`.`summary` = 'You can learn HTML in thos course', `courses`.`updated_at` = '2023-09-27 05:51:14.062716' WHERE `courses`.`id` = 2

  def destroy # rubocop:disable Metrics/AbcSize
    @course = Course.find(params[:id])
    respond_to do |format|
      if @course.destroy
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
DELETE FROM `courses` WHERE `courses`.`id` = 1

  def show
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1