app/controllers/admin/lessons_controller.rb

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
---
  def index
    @section = Section.find(params[:section_id])

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
---
  def new
    @section = Section.find(params[:section_id])

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
INSERT INTO `lessons` (`title`, `description`, `section_id`, `created_at`, `updated_at`) VALUES ('First', 'First One', 1, '2023-09-28 13:46:28.189036', '2023-09-28 13:46:28.189036')
UPDATE `lessons` SET `lessons`.`updated_at` = '2023-09-28 13:46:28.199950' WHERE `lessons`.`id` = 12
---
  def create
    @section = Section.find(params[:section_id])
    @lesson = @section.lessons.create(lesson_params)
    if @lesson.save

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`section_id` = 1 AND `lessons`.`id` = 9 LIMIT 1
---
  def edit
    @section = Section.find(params[:section_id])
    @lesson = @section.lessons.find(params[:id])

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`section_id` = 1 AND `lessons`.`id` = 9 LIMIT 1
DELETE FROM `lessons` WHERE `lessons`.`id` = 9
---
  def destroy
    @section = Section.find(params[:section_id])
    @lesson = @section.lessons.find(params[:id])
    @lesson.destroy