app/controllers/admin/lessons_controller.rb

  def index # rubocop:disable Metrics/MethodLength,Metrics/AbcSize
    if params[:section_id].present?
      @section = Section.find_by(id: params[:id])
      @lessons = @section.lessons.includes(clip_attachment: :blob, attachments_attachments: :blob)
---
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`section_id` = 1