app/controllers/admin/sections_controller.rb

  def index # rubocop:disable Metrics/AbcSize,Metrics/MethodLength
    if params[:course_id].present?
      @course = Course.find(params[:course_id])
      @sections = @course.sections
      respond_to(&:js)
    else
      @sections = []
      @sections = Section.all.includes(:course)
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 2 LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 2 AND `sections`.`id` = 1 LIMIT 1

  def create # rubocop:disable Metrics/AbcSize,Metrics/MethodLength
    @section = Section.new(section_params)
    respond_to do |format|
      if @section.save
        @sections = @section.course.sections
        @section = Section.find_by(id: @section.id)
---
INSERT INTO `sections` (`title`, `course_id`, `created_at`, `updated_at`) VALUES ('IntroDuction', 2, '2023-09-26 16:10:46.108829', '2023-09-26 16:10:46.108829')
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 2 LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 2 AND `sections`.`id` = 10 LIMIT 1

  def update
    respond_to do |format|
      if @section.update(section_params)
---
UPDATE `sections` SET `sections`.`updated_at` = '2023-09-27 11:05:27.537125', `sections`.`description` = 'Introduction to HTml' WHERE `sections`.`id` = 1

  def destroy # rubocop:disable Metrics/AbcSize,Metrics/MethodLength
    @section = Section.find_by(id: params[:id])
    respond_to do |format|
      if @section&.destroy
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 13 LIMIT 1
DELETE FROM `sections` WHERE `sections`.`id` = 13