app/controllers/admin/sections_controller.rb

  def index
    # @courses = Course.find(params[:course_id])
    # @sections = @courses.sections
    # @sections = Section.all
    @sections = []
    Section.all.includes(:course).each do |section|
      @sections.push(section)
---
INSERT INTO `sections` (`title`, `course_id`, `created_at`, `updated_at`) VALUES ('IntroDuction', 2, '2023-09-26 16:10:46.108829', '2023-09-26 16:10:46.108829')

  def update
    @section = Section.find(params[:id])
    @section.update(section_params)
---
UPDATE `sections` SET `sections`.`updated_at` = '2023-09-27 11:05:27.537125', `sections`.`description` = 'Introduction to HTml' WHERE `sections`.`id` = 1

  def destroy
    @section = Section.find(params[:id])
    @section.destroy
---
DELETE FROM `sections` WHERE `sections`.`id` = 13