app/controllers/admin/videos_controller.rb

    def index
        @section = Section.find(params[:section_id])
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

    def new
        @section = Section.find(params[:section_id])
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

    def create
        @section = Section.find(params[:section_id])
        @video = @section.videos.create(video_params)
        if @video.save
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
INSERT INTO `videos` (`title`, `description`, `section_id`, `created_at`, `updated_at`) VALUES ('First', 'sdsadsdfsfs', 1, '2023-09-27 13:38:01.564389', '2023-09-27 13:38:01.564389')
UPDATE `videos` SET `videos`.`updated_at` = '2023-09-27 18:22:48.025855' WHERE `videos`.`id` = 9

    def edit
        @section = Section.find(params[:section_id])
        @video = @section.videos.find(params[:id])
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
SELECT `videos`.* FROM `videos` WHERE `videos`.`section_id` = 1 AND `videos`.`id` = 1 LIMIT 1

    def update
        @section = Section.find(params[:section_id])
        @video = @section.videos.find(params[:id])
        if @video.update(video_params)
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
SELECT `videos`.* FROM `videos` WHERE `videos`.`section_id` = 1 AND `videos`.`id` = 4 LIMIT 1
UPDATE `videos` SET `videos`.`description` = 'first one', `videos`.`updated_at` = '2023-09-27 13:44:45.222024' WHERE `videos`.`id` = 4

    def destroy
        @section = Section.find(params[:section_id])
        @video = @section.videos.find(params[:id])
        @video.destroy
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
SELECT `videos`.* FROM `videos` WHERE `videos`.`section_id` = 1 AND `videos`.`id` = 2 LIMIT 1
DELETE FROM `videos` WHERE `videos`.`id` = 2

    def show
        @section = Section.find(params[:section_id])
        @video = @section.videos.find(params[:id])
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
SELECT `videos`.* FROM `videos` WHERE `videos`.`section_id` = 1 AND `videos`.`id` = 1 LIMIT 1