app/views/admin/lessons/index.html.erb

SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`section_id` = 1
---
                    <label for="Section" class="md:w-[30%] w-[30%] block mb-2 text-lg font-medium text-[#000]">Section</label>
                    <%= collection_select(:lesson, :section_id, Section.all, :id, :title, { include_blank: "Select Section", selected: '' }, { class: "mb-4 bg-gray-50 border border-gray-300 text-sm rounded-lg focus:ring-0 focus:ring-offset-0 focus:border-gray-200 outline-none block w-full md:w-[70%] p-2.5 rounded-[7px] bg-[#fff] text-[#818181] filter-handle" }) %>