app/controllers/admin_controller.rb

SELECT `users`.* FROM `users`
---
    def users
      @users = User.all