app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def no_deleted_users
    return unless User.find(params[:email]).deleted?