app/controllers/courses_controller.rb

SELECT `courses`.* FROM `courses`
---
  def index
    @courses = Course.includes(:sections).all

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 2 LIMIT 1
---
  def show
    @course = Course.find(params[:id])