app/controllers/entrollments_controller.rb

    def new
        @entrollment = Entrollment.new
        @course = Course.find(params[:course_id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 2 LIMIT 1

      def create
        @entrollment = Entrollment.new(entrollment_params)

        if @entrollment.save
---
INSERT INTO `entrollments` (`status`, `user_id`, `course_id`, `created_at`, `updated_at`) VALUES ('requested', 3, 2, '2023-09-28 11:42:47.940010', '2023-09-28 11:42:47.940010')