app/views/admin/courses/index.html.erb

  <div class="text-[#31B978] text-[18px] font-bold  w-[70%] md:w-[35%] pb-4 sm:pb-0">
    <%= collection_select(:course, :course_name, Course.all, :id, :course_name, { prompt: "Select Course", selected: '' }, { class: "bg-gray-50 border-0 foucus:ring-0 text-[#818181] text-[16px] font-medium rounded-lg outline-none block w-full p-2.5 rounded-[7px] bg-[#fff] text-[#818181] filter-handle custom-select sources" }) %>
---
SELECT `courses`.* FROM `courses`